# CannotSolveRebarShapeUsingDataFromDimension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CannotSolveRebarShapeUsingDataFromDimension Property
BuiltInFailures..::..RebarFailures Class See Also
---
Cannot solve rebar shape using the current constraints.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSolveRebarShapeUsingDataFromDimension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSolveRebarShapeUsingDataFromDimension As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSolveRebarShapeUsingDataFromDimension {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace